Objectives

- Use `read_csv` to read tabular text data into Python
- Know how to find and use other read_/to_ methods of Pandas
- Verify the data types of the data after reading data


Content to cover

- read_csv
- to_excel/read_excel example
- head()/tail()
- dtypes

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

![](../schemas/02_readwrite.png)

### Read data from text file

> I want to start analyzing the titanic passenger data, available as CSV file

In [7]:
titanic = pd.read_csv("../data/titanic.csv")

To read CSV data, the reading functionalality provide the `read_csv` function to read the data and store it as a Pandas DataFrame.

Make sure to have a first check on the data as things might go wrong. Checking the first 5 records is a good first check:

In [8]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Besides, a check on how Pandas interpreted each of the columns is an important first step as well.

In [11]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Read and write data from other file formats

> I want to know what other read and write methods are available in Pandas

> My colleague requested the titanic data as an spreadsheet

In [12]:
titanic.to_excel('titanic.xlsx', sheet_name='passengers', index=False)

In [11]:
titanic = pd.read_excel('titanic.xlsx', 'passengers', 
                        index_col=None, na_values=['NA'])

In [14]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [13]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q